kamiladas/Three-Phase-Energy-Monitor-on-ESP32/ESP32CaptivePortal.cpp
#include "ESP32CaptivePortal.h"
#include <ArduinoJson.h>
#include <ESPmDNS.h>
#include <SD.h>



ESP32CaptivePortal::ESP32CaptivePortal()
  : server(80), isNetworkConfigured(false), isNetworkError(false), isTimeOnline(false) {}

void ESP32CaptivePortal::begin() {
  Serial.begin(115200);


  String s_ssid = loadConfig("/config.json", "dev_ssid");
  String s_pass = loadConfig("/config.json", "dev_password");


  updateEnergyValues();

  if (s_ssid.isEmpty()) {
    s_ssid = "Digital_Multimeter";
  }
  const char *ssid = s_ssid.c_str();
  const char *password = s_pass.c_str();
  WiFi.mode(WIFI_AP);
  WiFi.softAP(ssid, password);
  Serial.print("AP IP address_ESP: ");
  Serial.println(WiFi.softAPIP());
  dnsServer.start(53, "*", WiFi.softAPIP());
  if (!MDNS.begin("energy")) {
    Serial.println("Error setting up MDNS responder!");
    while (1) {
      delay(1000);
    }
  }
  Serial.println("mDNS responder started");
  setupServer();
  server.begin();
  Serial.println("Captive Portal - WiFi Configuration");
 // s_ssid = loadConfig("/config.json", "SSID");
///////////////////////// skip connection script
  
  WiFi.begin("TOTOLINK_A3002RU", "adasiaki4A8");
  Serial.print("Łączenie z siecią WiFi...");
  while (WiFi.status() != WL_CONNECTED) {
    delay(1000);
    Serial.print(".");
  }



  if (!s_ssid.isEmpty()) { loadConfiguration(); }
  MDNS.addService("http", "tcp", 80);
}

void ESP32CaptivePortal::loop() {
  dnsServer.processNextRequest();
}





String SavedtotalEnergy = "0";
String SavedenergyPhase1 = "0";
String SavedenergyPhase2 = "0";
String SavedenergyPhase3 = "0";

void ESP32CaptivePortal::updateEnergyValues() {
    SavedtotalEnergy = this->loadConfig("/GetEnery.json", "totalEnergy");
    SavedenergyPhase1 = this->loadConfig("/GetEnery.json", "energyPhase1");
    SavedenergyPhase2 = this->loadConfig("/GetEnery.json", "energyPhase2");
    SavedenergyPhase3 = this->loadConfig("/GetEnery.json", "energyPhase3");

    // Przypisanie wartości "0" jeśli ciąg jest pusty
    SavedtotalEnergy = SavedtotalEnergy.isEmpty() ? "0" : SavedtotalEnergy;
    SavedenergyPhase1 = SavedenergyPhase1.isEmpty() ? "0" : SavedenergyPhase1;
    SavedenergyPhase2 = SavedenergyPhase2.isEmpty() ? "0" : SavedenergyPhase2;
    SavedenergyPhase3 = SavedenergyPhase3.isEmpty() ? "0" : SavedenergyPhase3;
}


void ESP32CaptivePortal::handleConfiguration(AsyncWebServerRequest *request) {
  String ssid;
  String password;

  if (request->hasParam("ssid") && request->hasParam("password")) {
    ssid = request->getParam("ssid")->value();
    password = request->getParam("password")->value();

    WiFi.begin(ssid.c_str(), password.c_str());

    int connectionAttempts = 0;
    while (WiFi.status() != WL_CONNECTED && connectionAttempts < 3) {
      delay(1000);
      connectionAttempts++;
    }

    if (WiFi.status() == WL_CONNECTED) {
      Serial.println("");
      Serial.println("Połączono z WiFi");
      Serial.print("Adres IP: ");
      Serial.println(WiFi.localIP());
      MDNS.addService("http", "tcp", 80);

      // Ustaw flagę isNetworkConfigured na true, jeśli sieć została skonfigurowana
      if (!isNetworkConfigured) {
        isNetworkConfigured = true;
        Serial.println("isNetworkConfigured ustawione na true");
        saveConfig("/config.json", "SSID", ssid);
        saveConfig("/config.json", "password", password);
      }
    } else {
      request->send(SPIFFS, "/html/inc_pass.html", "text/html");
    }
    request->redirect("/connected");
  } else {
    request->send(400, "text/plain", "Nieprawidłowe żądanie");
  }
}



void ESP32CaptivePortal::handleRoot(AsyncWebServerRequest *request) {
  if (isNetworkConfigured && isConnectedToESP(request)) {
    File file = SPIFFS.open("/connected.html", "r");
    if (file) {
      file.close();
      request->redirect("/connected");
    } else {
      request->send(404);
    }
  } else if (!isNetworkConfigured && isConnectedToESP(request)) {
    File file = SPIFFS.open("/html/index_html.html", "r");
    if (file) {
      String html = file.readString();
      file.close();
      request->send(200, "text/html", html);
    } else {
      request->send(404);
    }
  } else {

    handleEnergy(request);
  }
}





void ESP32CaptivePortal::handleDisconnect(AsyncWebServerRequest *request) {
  WiFi.disconnect();
  isNetworkConfigured = false;
  Serial.println("isNetworkConfigured ustawione na false");
  // Przekieruj na stronę konfiguracji
  if (saveConfig("/config.json", "SSID", "")) {
    Serial.println("Plik konfiguracyjny usunięty.");
  } else {
    Serial.println("Błąd usuwania pliku konfiguracyjnego.");
  }
  request->redirect("/");
}







void ESP32CaptivePortal::handleEnergy(AsyncWebServerRequest *request) {
  if (request->method() == HTTP_GET) {
    // Obsługa żądania GET - wysyłanie strony HTML
    if (SPIFFS.exists("/html/energy.html")) {
      request->send(SPIFFS, "/html/energy.html", "text/html");
    }


    else {
      // Obsługa innych metod HTTP
      request->send(400, "text/plain", "Nieobsługiwana metoda");
    }
  }
}



bool ESP32CaptivePortal::isConnectedToESP(AsyncWebServerRequest *request) {
  // Sprawdź adres IP klienta
  IPAddress clientIP = request->client()->remoteIP();

  // Sprawdź, czy adres IP klienta należy do zakresu adresów ESP
  if (clientIP[0] == 192 && clientIP[1] == 168 && clientIP[2] == 4) {
    return true;  // Klient jest podłączony do sieci ESP
  } else {
    return false;  // Klient jest podłączony do sieci lokalnej
  }
}
String ESP32CaptivePortal::getNetworksJSON() {
  int numNetworks = WiFi.scanNetworks();
  String json = "[";
  for (int i = 0; i < numNetworks; i++) {
    if (i > 0) json += ",";
    json += "{\"ssid\":\"" + WiFi.SSID(i) + "\",\"rssi\":" + String(WiFi.RSSI(i)) + "}";
  }
  json += "]";
  return json;
}

void ESP32CaptivePortal::handleScanWiFi(AsyncWebServerRequest *request) {
  String networksJSON = getNetworksJSON();
  request->send(200, "application/json", networksJSON);
}


bool ESP32CaptivePortal::isSSIDAvailable(const String &ssid) {
  int numNetworks = WiFi.scanNetworks();

  for (int i = 0; i < numNetworks; i++) {
    if (WiFi.SSID(i) == ssid) {
      return true;  // Znaleziono SSID
    }
  }

  return false;  // SSID nie jest dostępne
}




bool ESP32CaptivePortal::saveConfig(const String &fileName, const String &field, const String &value) {
  // Sprawdź istnienie pliku
  if (!SPIFFS.exists(fileName)) {
    // Twórz nowy plik i zapisz początkową pustą strukturę JSON
    File configFile = SPIFFS.open(fileName, "w");
    if (!configFile) {
      Serial.println("Błąd tworzenia pliku konfiguracyjnego.");
      return false;
    }
    configFile.print("{}");
    configFile.close();
  }

  // Kontynuuj zapis do pliku
  File configFile = SPIFFS.open(fileName, "r+");
  if (configFile) {
    // Odczytaj zawartość pliku
    size_t fileSize = configFile.size();
    std::unique_ptr<char[]> buf(new char[fileSize]);
    configFile.readBytes(buf.get(), fileSize);
    configFile.close();

    // Przetwórz zawartość pliku jako JSON
    DynamicJsonDocument jsonDoc(1024);
    DeserializationError error = deserializeJson(jsonDoc, buf.get());
    if (error) {
      Serial.println("Błąd deserializacji pliku konfiguracyjnego.");
      return false;
    }

    // Sprawdź, czy pole istnieje w dokumencie JSON
    if (jsonDoc.containsKey(field)) {
      // Pole istnieje - nadpisz jego wartość
      jsonDoc[field] = value;
    } else {
      // Pole nie istnieje - dodaj nowe pole z wartością
      jsonDoc[field] = value;
    }

    // Zapisz zmodyfikowany JSON do pliku
    configFile = SPIFFS.open(fileName, "w");
    if (configFile) {
      serializeJson(jsonDoc, configFile);
      configFile.close();
      Serial.println("Plik konfiguracyjny zapisany.");
      return true;
    } else {
      Serial.println("Błąd zapisu pliku konfiguracyjnego.");
      return false;
    }
  } else {
    Serial.println("Błąd odczytu pliku konfiguracyjnego.");
    return false;
  }
}

void ESP32CaptivePortal::loadConfiguration() {


