kamiladas/Three-Phase-Energy-Monitor-on-ESP32/ESP32CaptivePortal.cpp
  // Odczytaj SSID z pliku konfiguracyjnego
  String ssid = loadConfig("/config.json", "SSID");
  String password = loadConfig("/config.json", "password");

  if (isSSIDAvailable(ssid)) {
    
    ssid.trim();
    password.trim();
    Serial.print("Łączenie z siecią WiFi...");
    int timeout = 10;  // Czas oczekiwania na połączenie (w sekundach)
    while (WiFi.status() != WL_CONNECTED && timeout > 0) {
      delay(1000);
      Serial.print(".");
      timeout--;
    }

    if (WiFi.status() == WL_CONNECTED) {
      Serial.println();
      Serial.print("Połączono z siecią WiFi. Adres IP: ");
      Serial.println(WiFi.localIP());
      isNetworkConfigured = true;
      Serial.println("isNetworkConfigured ustawione na true");
    } else {
      Serial.println();
      Serial.println("Nie udało się połączyć z siecią WiFi.");
    }
  }

  else {
   
  }
}





String ESP32CaptivePortal::loadConfig(const String &fileName, const String &fieldName) {
  // Otwórz plik konfiguracyjny
  File configFile = SPIFFS.open(fileName, "r");
  if (configFile) {
    // Wczytaj zawartość pliku
    size_t fileSize = configFile.size();
    std::unique_ptr<char[]> buf(new char[fileSize]);
    configFile.readBytes(buf.get(), fileSize);
    configFile.close();

    // Przetwórz zawartość pliku jako JSON
    DynamicJsonDocument jsonDoc(1024);
    DeserializationError error = deserializeJson(jsonDoc, buf.get());
    if (error) {
      // Serial.println("Błąd Serializacji  pliku konfiguracyjnego.");
      return "";
    }

    // Sprawdź, czy pole istnieje
    if (jsonDoc.containsKey(fieldName)) {
      // Pobierz wartość pola
      String fieldValue = jsonDoc[fieldName].as<String>();
      return fieldValue;
    } else {
      //Serial.println("Pole '" + fieldName + "' nie istnieje w pliku konfiguracyjnym.");
      return "";
    }
  } else {
    Serial.println("Błąd odczytu pliku konfiguracyjnego.");
    return "";
  }
}

////////////////////////////////////////////////////////////
void ESP32CaptivePortal::handleTimezones(AsyncWebServerRequest *request) {
  if (request->method() == HTTP_POST) {
    if (request->arg("isOfflineTime") == "true") {
      isTimeOnline = true;
      // Czas Offline, odczytaj datę i godzinę z formularza
      String offlineDate = request->arg("offlineDate");
      String offlineTime = request->arg("offlineTime");
      saveConfig("/config.json", "offlineDate", offlineDate);
      saveConfig("/config.json", "offlineTime", offlineTime);
      Serial.println(loadConfig("/config.json", "onlineDate"));
      request->send(200, "text/plain", "Czas Offline został zatwierdzony.");
    }
    if (request->arg("isOfflineTime") == "false") {
      isTimeOnline = false;
      String selectedTimezone = request->arg("timezone");
      Serial.println("Strefa czasowa: " + selectedTimezone);
      saveConfig("/config.json", "timezone", selectedTimezone);
      request->send(200, "text/plain", "Strefa czasowa została zatwierdzona");
    }
  } else if (request->method() == HTTP_GET) {
    if (SPIFFS.exists("/timezone.json")) {
      request->send(SPIFFS, "/timezone.json", "application/json");
    } else {
      request->send(404, "text/plain", "Plik JSON nie istnieje");
    }
  } else {
    request->send(400, "text/plain", "Nieprawidłowe żądanie.");
  }
}

///////////////////////////////////
String ESP32CaptivePortal::getCurrentTime() {
  WiFiUDP ntpUDP;
  NTPClient timeClient(ntpUDP, "time.google.com");
  String dayStamp;
  String timeStamp;
  String formattedDate;
  String formattedTime;
  int splitT;
  timeClient.begin();
  timeClient.update();

  String timezone = loadConfig("/config.json", "timezone");
  if (timezone != "" && timezone != "0" && isTimeOnline == false) {
    int timezoneValue = timezone.toInt();
    timeClient.setTimeOffset(3600 * timezoneValue);  // Ustawienie przesunięcia czasowego (w sekundach)
  }
  if (isTimeOnline == true) {
    formattedDate = timeClient.getFormattedDate();
    formattedTime = timeClient.getFormattedTime();
    splitT = formattedDate.indexOf("T");
    dayStamp = formattedDate.substring(0, splitT);
    timeStamp = formattedDate.substring(splitT + 1, formattedDate.length() - 1);
    static int timeZeroOffset;
    static String prevTime = "";
    static String prevDate = "";
    String offlineDate = loadConfig("/config.json", "offlineDate");
    String offlineTime = loadConfig("/config.json", "offlineTime");
    int timeOffset = getCustomDateTimeInSeconds(offlineDate, offlineTime);
    if (offlineTime != prevTime || offlineDate != prevDate) {
      prevDate = offlineDate;
      prevTime = offlineTime;
      timeZeroOffset = (getCustomDateTimeInSeconds(dayStamp, timeStamp) * -1);
    }
    timeClient.setTimeOffset(timeOffset + timeZeroOffset);
  }
  timeClient.update();
  formattedDate = timeClient.getFormattedDate();
  formattedTime = timeClient.getFormattedTime();
  splitT = formattedDate.indexOf("T");
  dayStamp = formattedDate.substring(0, splitT);
  timeStamp = formattedDate.substring(splitT + 1, formattedDate.length() - 1);
  String combinedString = dayStamp + " " + formattedTime;

  return combinedString;
}


int ESP32CaptivePortal::getCustomDateTimeInSeconds(String customDateStr, String customTimeStr) {

  int year = customDateStr.substring(0, 4).toInt();
  int month = customDateStr.substring(5, 7).toInt();
  int day = customDateStr.substring(8, 10).toInt();
  int hour = customTimeStr.substring(0, 2).toInt();
  int minute = customTimeStr.substring(3, 5).toInt();
  int second = customTimeStr.substring(6, 8).toInt();
  //Serial.println(second);
  // Utwórz struct tm i ustaw podaną datę i godzinę
  struct tm timeinfo;
  timeinfo.tm_year = year - 1900;
  timeinfo.tm_mon = month - 1;
  timeinfo.tm_mday = day;
  timeinfo.tm_hour = hour;
  timeinfo.tm_min = minute;
  timeinfo.tm_sec = second;

  // Użyj mktime() do przeliczenia na liczbę sekund od czasu zero
  time_t customDateTime = mktime(&timeinfo);

  // Zwróć ilość sekund jako wartość funkcji
  return static_cast<int>(customDateTime);
}

float ESP32CaptivePortal::calculateTimeDifferenceInSeconds(String dateTimeStr1, String dateTimeStr2) {
  // Konwersja pierwszej daty z formatu string na time_t
  struct tm tm1;
  sscanf(dateTimeStr1.c_str(), "%d-%d-%d %d:%d:%d",
         &tm1.tm_year, &tm1.tm_mon, &tm1.tm_mday,
         &tm1.tm_hour, &tm1.tm_min, &tm1.tm_sec);
  tm1.tm_year -= 1900;
  tm1.tm_mon -= 1;
  time_t time1 = mktime(&tm1);

  // Konwersja drugiej daty z formatu string na time_t
  struct tm tm2;
  sscanf(dateTimeStr2.c_str(), "%d-%d-%d %d:%d:%d",
         &tm2.tm_year, &tm2.tm_mon, &tm2.tm_mday,
         &tm2.tm_hour, &tm2.tm_min, &tm2.tm_sec);
  tm2.tm_year -= 1900;
  tm2.tm_mon -= 1;
  time_t time2 = mktime(&tm2);

