kamiladas/Three-Phase-Energy-Monitor-on-ESP32/ESP32CaptivePortal.cpp
  // Oblicz różnicę czasu w sekundach
  double difference = difftime(time2, time1);

  // Sprawdź, czy różnica mieści się w zakresie od 0.5 do 3 sekund
  if (difference >= 0.5 && difference <= 3.0) {
    return static_cast<float>(difference);
  } else {
    return 1.5f;  // Zwróć 1.5, jeśli nie mieści się w zakresie
  }
}



/// wartosci rzeczywiste
void ESP32CaptivePortal::handlePhaseDataRequest(AsyncWebServerRequest *request) {
  String response;
  DynamicJsonDocument doc(1024);

  // Tutaj dodaj kod do wypełnienia `doc` aktualnymi danymi pomiarowymi
  doc["phase1"]["voltageRMS"] = data.phase1.voltageRMS;
  doc["phase1"]["CurrentRMS"] = data.phase1.currentRMS;

  doc["phase2"]["voltageRMS"] = data.phase2.voltageRMS;
  doc["phase2"]["CurrentRMS"] = data.phase2.currentRMS;

  doc["phase3"]["voltageRMS"] = data.phase3.voltageRMS;
  doc["phase3"]["CurrentRMS"] = data.phase3.currentRMS;


  serializeJson(doc, response);
  request->send(200, "application/json", response);
}


String ESP32CaptivePortal::sumStrings(String A, String B) {
  float conversion1 = A.toFloat();
  float conversion2 = B.toFloat();

  float suma = conversion1 + conversion2;

  return String(suma, 12);
}

String ESP32CaptivePortal::Generate_FlieName(bool setup) {
  String currentTime = getCurrentTime();
  String currentHour = currentTime.substring(11, 13);  // Pobranie aktualnej godziny
  String currentDate = currentTime.substring(0, 10);   // Pobranie aktualnej daty (format YYYY-MM-DD)

  String lastDate = loadConfig("/GetEnery.json", "lastDate");
  String lastHour = loadConfig("/GetEnery.json", "lastHour");
  Serial.println(lastDate);



  // Sprawdzamy, czy data się zmieniła lub czy zmieniła się godzina
  if (lastDate != currentDate || lastHour != currentHour) {
    ////tutaj Udate zachowanych danych..
    bool saveDate = this->saveConfig("/GetEnery.json", "lastDate", currentDate);
    bool saveHour = this->saveConfig("/GetEnery.json", "lastHour", currentHour);
    // Formatujemy datę do postaci "YYYY_MM_DD"
    String formattedDate = currentDate.substring(0, 4) + "-" + currentDate.substring(5, 7) + "-" + currentDate.substring(8, 10);

    // Zwracamy ścieżkę folderu i nazwę pliku z aktualną datą i godziną
    return "/" + formattedDate + "/" + currentHour + "_00.csv";
  }

  // W przeciwnym razie zwracamy ścieżkę i nazwę pliku z ostatnio zaktualizowaną datą i godziną
  return "/" + lastDate + "/" + lastHour + "_00.csv";
}




String ESP32CaptivePortal::createJsonFileList(String path) {
  File dir = SD.open(path.c_str());

  if (!dir || !dir.isDirectory()) {
    Serial.println("Error opening directory");
    return "{}";
  }

  DynamicJsonDocument doc(5500);
  JsonArray array = doc.to<JsonArray>();

  String processedDirs = ",";  // Używamy przecinka jako separatora

  while (File file = dir.openNextFile()) {
    String fileName = file.name();

    // Sprawdzenie, czy folder już został przetworzony
    if (processedDirs.indexOf("," + fileName + ",") != -1) {
      continue;  // Pomiń, jeśli folder był już przetworzony
    }

    JsonObject obj = array.createNestedObject();
    obj["name"] = fileName;
    obj["size"] = file.size();

    if (file.isDirectory()) {
      processedDirs += fileName + ",";  // Dodaj folder do listy przetworzonych
    }

    file.close();
  }
  dir.close();

  String output;
  serializeJson(doc, output);
  return output;
}


void ESP32CaptivePortal::setupServer() {
  server.on("/", HTTP_GET, [this](AsyncWebServerRequest *request) {
    handleRoot(request);
  });

  server.on("/configure", HTTP_GET, [this](AsyncWebServerRequest *request) {
    if (isConnectedToESP(request)) {
      handleConfiguration(request);
    } else {
      request->send(SPIFFS, "/html/handle_localUser.html", "text/html");
    }
  });
  //// trzeba zabezpieczyć
  server.on("/scanWiFi", HTTP_GET, [this](AsyncWebServerRequest *request) {
    handleScanWiFi(request);
  });

  server.on("/getTimezones", HTTP_ANY, [this](AsyncWebServerRequest *request) {
    handleTimezones(request);
  });

  server.on("/disconnect", HTTP_GET, [this](AsyncWebServerRequest *request) {
    if (isConnectedToESP(request)) {
      handleDisconnect(request);
    } else {
      request->send(SPIFFS, "/html/handle_localUser.html", "text/html");
    }
  });

  server.on("/connected", HTTP_GET, [this](AsyncWebServerRequest *request) {
    if (isConnectedToESP(request)) {
      if (SPIFFS.exists("/html/connected.html")) {
        File htmlFile = SPIFFS.open("/html/connected.html", "r");
        String html = htmlFile.readString();
        htmlFile.close();
        html.replace("%IP_ADDRESS%", WiFi.localIP().toString());
        request->send(200, "text/html", html);
      } else {
        request->send(404);
      }
    } else {
      request->send(SPIFFS, "/html/handle_localUser.html", "text/html");
    }
  });

  server.onNotFound(std::bind(&ESP32CaptivePortal::handleRoot, this, std::placeholders::_1));

  server.on("/energy", HTTP_ANY, std::bind(&ESP32CaptivePortal::handleEnergy, this, std::placeholders::_1));

  server.on("/updatePhase", HTTP_GET, std::bind(&ESP32CaptivePortal::handlePhaseDataRequest, this, std::placeholders::_1));

  server.on("/settings", HTTP_GET, [this](AsyncWebServerRequest *request) {
    if (isConnectedToESP(request)) {
    request->send(SPIFFS, "/html/settings.html", "text/html");
     }
    else {
    request->send(SPIFFS, "/html/handle_localUser.html", "text/html");
     }
  });

  server.on("/resetFactorySettings", HTTP_POST, [this](AsyncWebServerRequest *request) {
    if (isConnectedToESP(request)) {
      if (SPIFFS.remove("/config.json")) {
        request->send(200, "text/plain", "Ustawienia fabryczne zostały przywrócone.");
        WiFi.disconnect(true);
        delay(100);
        request->send(200, "text/plain", "resetowania urządzenia .");
        ESP.restart();  // Używamy ESP.restart() zamiast esp.restart()
      } else {
        request->send(500, "text/plain", "Błąd podczas resetowania ustawień fabrycznych.");
      }
    } else {
      request->send(SPIFFS, "/html/handle_localUser.html", "text/html");
    }
  });

  server.on("/changePassword", HTTP_POST, [this](AsyncWebServerRequest *request) {
    if (isConnectedToESP(request)) {
      // Pobierz przesłane dane formularza
      String currentPassword = request->arg("currentPassword");
      String newPassword = request->arg("newPassword");
      // Pobierz z pliku konfiguracyjnego aktualne hasło
      String savedPassword = this->loadConfig("/config.json", "dev_password");

      // Porównaj przesłane hasło z zapisanym hasłem
      if (currentPassword == savedPassword) {
        // Zapisz nowe hasło w pliku konfiguracyjnym
        bool success = this->saveConfig("/config.json", "dev_password", newPassword);

        if (success) {
          // Przygotuj treść odpowiedzi tekstowej z informacją o sukcesie
          String response = "Hasło zostało zmienione. Urządzenie zostanie zrestartowane.";
          request->send(200, "text/plain", response);
          delay(100);
          ESP.restart();
          Serial.println("savedPassword: " + newPassword);
        } else {
          // Przygotuj treść odpowiedzi tekstowej z informacją o błędzie zapisu
          String response = "Błąd podczas zapisywania hasła.";
          request->send(500, "text/plain", response);
        }
      } else {
        // Przesłane hasło nie jest poprawne
        String response = "Obecne hasło jest nieprawidłowe.";
        request->send(400, "text/plain", response);
      }
    } else {
      request->send(SPIFFS, "/html/handle_localUser.html", "text/html");
    }
  });

