kamiladas/Three-Phase-Energy-Monitor-on-ESP32/ESP32CaptivePortal.cpp
  server.on("/changeSSID", HTTP_POST, [this](AsyncWebServerRequest *request) {
    // Pobierz aktualną nazwę SSID
    if (isConnectedToESP(request)) {
      String currentSSID = loadConfig("/config.json", "dev_ssid");

      // Odczytaj nowe SSID z formularza
      String newSSID = request->arg("ssid");
      // Sprawdź, czy nowe SSID jest zgodne z aktualnym
      if (newSSID == currentSSID) {
        request->send(200, "text/plain", "Nowe SSID musi się różnić od aktualnego SSID.");
        return;
      }

      // Nadpisz nowe SSID w pliku konfiguracyjnym
      bool success = saveConfig("/config.json", "dev_ssid", newSSID);

      if (success) {
        request->send(200, "text/plain", "SSID zostało zmienione.");
      } else {
        request->send(500, "text/plain", "Błąd podczas zapisu pliku konfiguracyjnego.");
      }

      // Rozłącz z siecią Wi-Fi i zrestartuj moduł
      delay(100);
      ESP.restart();
    } else {
      request->send(SPIFFS, "/html/handle_localUser.html", "text/html");
    }
  });


  server.on("/reset", HTTP_POST, [this](AsyncWebServerRequest *request) {
    // Pobierz aktualną nazwę SSID
    if (isConnectedToESP(request)) {
      request->send(200, "text/plain", "Nastapi reset urzadzenia , upenij sie ze  siec sparowana z urzadzeniem jest już dostępna.");
      delay(100);
      WiFi.disconnect(true);
      ESP.restart();
    } else {
      request->send(SPIFFS, "/html/handle_localUser.html", "text/html");
    }
  });
  server.on("/NetWorkError", HTTP_GET, [this](AsyncWebServerRequest *request) {
    request->send(SPIFFS, "/html/NetWorkError.html", "text/html");
  });
  server.on("/test", HTTP_GET, [this](AsyncWebServerRequest *request) {
    request->send(SPIFFS, "/html/test.html", "text/html");
  });


  server.on("/display", HTTP_GET, [this](AsyncWebServerRequest *request) {
    String path = getFPath();
    if (SD.exists(path.c_str())) {
      request->send(SD, path.c_str(), "text/csv", true);
    } else {
      request->send(404, "text/plain", "File Not Found");
    }
  });


  server.on("/filelist", HTTP_GET, [this](AsyncWebServerRequest *request) {
    String path = "/main_data";  // Ścieżka do katalogu, który chcesz wylistować
    String fileList = createJsonFileList(path);
    request->send(200, "application/json", fileList);
  });


  server.on("/prasedata", HTTP_GET, [this](AsyncWebServerRequest *request) {
    request->send(SPIFFS, "/html/prase_data.html", "text/html");
  });




  server.on("/download", HTTP_GET, [](AsyncWebServerRequest *request) {
    ///esp_task_wdt_reset();
    if (request->hasParam("file")) {
      String fileName = request->getParam("file")->value();
      if (SD.exists(fileName)) {
        request->send(SD, fileName, String(), true);

      } else {
        request->send(404, "text/plain", "File not found");
      }
    } else {
      request->send(400, "text/plain", "Bad Request");
    }
  });

  server.on("/savedEnergy", HTTP_GET, [this](AsyncWebServerRequest *request) {
    SavedtotalEnergy = this->loadConfig("/GetEnery.json", "totalEnergy");
    SavedenergyPhase1 = this->loadConfig("/GetEnery.json", "energyPhase1");
    SavedenergyPhase2 = this->loadConfig("/GetEnery.json", "energyPhase2");
    SavedenergyPhase3 = this->loadConfig("/GetEnery.json", "energyPhase3");


    String jsonResponse = "{\"totalEnergy\": \"" + SavedtotalEnergy + "\", \"energyPhase1\": \"" + SavedenergyPhase1 + "\", \"energyPhase2\": \"" + SavedenergyPhase2 + "\", \"energyPhase3\": \"" + SavedenergyPhase3 + "\"}";

    request->send(200, "application/json", jsonResponse);
  });
}
